{"head":{"title":"Introduction","description":"PIE: Portable Interactions and Elements * * * Portable Interactions and Elements (PIE) is an Open Source framework for building,…"},"body":"<h1 id=\"pie-portable-interactions-and-elements\"><a href=\"#pie-portable-interactions-and-elements\" class=\"phenomic-HeadingAnchor\">#</a>PIE: Portable Interactions and Elements</h1>\n<hr>\n<p>Portable Interactions and Elements (PIE) is an Open Source framework for building, distributing and rendering re-usable UI elements and interactions that can capture a user's response, analyze a user's response, and report an outcome and learning activity from the user interaction.</p>\n<p>It supports the development of highly interactive questions and assessment interactions that can be shared and distributed to run on any web-based platform, fully preserving their design and functionality.</p>\n<h3 id=\"what-is-it-for\"><a href=\"#what-is-it-for\" class=\"phenomic-HeadingAnchor\">#</a>What is it For?</h3>\n<p>Currently, it is quite difficult to author assessments that:</p>\n<ul>\n<li>Look and behave in the same way as the author intended, regardless of which system they are used in </li>\n<li>Support more advanced interactions that are engaging and effective for assessing knowledge</li>\n<li>Are simple to share between authors and learning systems while preserving support for the above 2 goals</li>\n<li>Use more advanced scoring algorithms</li>\n</ul>\n<p>The PIE framework addresses this by providing:</p>\n<ul>\n<li>A framework and tools for developing re-usable assessment interactions and UI elements </li>\n<li>An Open Source Player, for rendering assessments that use PIEs</li>\n<li>An Open Source format and tools, for sharing assessments in a 'binary' format that preserves the exact behaviour and design of the Assessment Item.</li>\n<li>A suite of Open Source PIEs including a variety of question types and tools </li>\n</ul>\n<h3 id=\"how-does-it-work\"><a href=\"#how-does-it-work\" class=\"phenomic-HeadingAnchor\">#</a>How Does it Work?</h3>\n<p>The PIE framework takes the approach that web-standards should be adopted wherever possible, and web development best practices should be used to make development as simple as possible.</p>\n<p>In Summary, the PIE Framework:</p>\n<ul>\n<li>uses <a href=\"https://www.w3.org/TR/custom-elements/\">Custom Elements</a> to define re-usable UI Elements</li>\n<li>uses JSON data to configure questions/interactions</li>\n<li>uses Javascript Modules (ES6 preferred, CommonJs Supported)</li>\n<li>uses NPM packages for the definition of reusable PIEs and for dependency resolution</li>\n<li>uses module bundling and packing techniques to create optimized shareable 'binary' bundles for rendering items</li>\n</ul>\n<h3 id=\"does-it-support-education-technology-standards\"><a href=\"#does-it-support-education-technology-standards\" class=\"phenomic-HeadingAnchor\">#</a>Does it Support Education Technology Standards?</h3>\n<p>PIE itself is not a standard, it is a working Open Source implementation. It is designed to provide a full-stack solution to an existing problem. It provides tools for developing, packaging and rendering Assessment Items that use PIE interactions and elements. Interactions that are developed and packaged using the tools provided in this framework will render correctly - on any modern web system.</p>\n<p>We have great respect for the standards process and standards bodies in the education field. If at some time there is interest in making the format/API definitions used by this technology a standard we would welcome this. </p>\n<h5 id=\"caliper--tin-can--cmi5\"><a href=\"#caliper--tin-can--cmi5\" class=\"phenomic-HeadingAnchor\">#</a>Caliper / Tin Can / CMI5</h5>\n<p>PIE supports exporting activity events during the lifecycle of user interaction with PIEs. Support for IMS Caliper/ ADLnet Tin Can/CMI5 is possible using this model.</p>\n<h5 id=\"ims-lti\"><a href=\"#ims-lti\" class=\"phenomic-HeadingAnchor\">#</a>IMS LTI</h5>\n<p>PIE is just a system for rendering the interactions and questions, and as such can be wrapped in any page that may use an LTI Launch. Similarly, outcomes from user interaction could be returned through LTI outcomes.</p>\n<h5 id=\"ims-qti\"><a href=\"#ims-qti\" class=\"phenomic-HeadingAnchor\">#</a>IMS QTI</h5>\n<p>PIE Format does not replace QTI 2, but QTI items can be converted into PIE format and 'compiled' and as such can be distributed with the full visual rendering and behavior included. </p>\n<h3 id=\"what-is-the-origin-of-pie\"><a href=\"#what-is-the-origin-of-pie\" class=\"phenomic-HeadingAnchor\">#</a>What is the Origin of PIE?</h3>\n<p>The PIE Framework is based on several years of work by CoreSpring.org in the field of building authoring and rendering tools for assessment interactions.</p>\n<p>We developed this technology to help fulfill our philanthropic mission of making high-quality, inexpensive &#x26; free assessment content available to educators.</p>\n<p>We believe this challenge of creating and sharing assessment items with advanced interactions with high-fidelity is shared across the education industry. </p>\n<p>We agree with the problem description and approach suggested by Smarter Balanced in the <a href=\"http://www.smarterapp.org/ARI/\">ARI</a> proposal and found that our existing technology was very compatible with delivering on this vision.</p>\n<p>We decided to make a new version of our solution to this problem available as an Open Source project in the hope that it will ultimately help educators have better access to high-quality and more interactive assessment interactions.</p>\n","__filename":"docs/index.md","__url":"/docs/","__resourceUrl":"/docs/index.html","__dataUrl":"/docs/index.html.897ec569d260778759be8a462b6a7401.json"}