{"head":{"description":"PIE Framework Advisory Board Charter 1\\. Background The PIE Framework open source project leadership is looking to supplement the…"},"body":"<h1 id=\"pie-framework-advisory-board-charter\"><a href=\"#pie-framework-advisory-board-charter\" class=\"phenomic-HeadingAnchor\">#</a>PIE Framework Advisory Board Charter</h1>\n<h2 id=\"1-background\"><a href=\"#1-background\" class=\"phenomic-HeadingAnchor\">#</a>1. Background</h2>\n<p>The PIE Framework open source project leadership is looking to\nsupplement the governance and contribution mechanisms with an advisory\nboard, as part of its long-term commitment to create a more open governance\nmodel.</p>\n<h2 id=\"2-purpose\"><a href=\"#2-purpose\" class=\"phenomic-HeadingAnchor\">#</a>2. Purpose</h2>\n<h3 id=\"21\"><a href=\"#21\" class=\"phenomic-HeadingAnchor\">#</a>2.1</h3>\n<p>The primary purpose of the PIE Framework Advisory Board is to advise CoreSpring Inc and the\nPIE Framework project core committers &#x26; team leadership on matters related to\nsupporting the long-term governance, structure, and roadmap of the PIE Framework open\nsource project. The following main areas are included in this charter:</p>\n<ul>\n<li>Provide a forum for individuals, contributors, and companies to discuss the issues\nunder the scope listed below.</li>\n<li>Provide guidance and input to leadership, and where possible, present a\nconsistent and consolidated opinion from the broader PIE Framework community.</li>\n</ul>\n<h3 id=\"22\"><a href=\"#22\" class=\"phenomic-HeadingAnchor\">#</a>2.2</h3>\n<p>The PIE Framework Advisory Board is not:</p>\n<ul>\n<li>Intended to serve as an authoritative governance board. The PIE Framework\nAdvisory Board advises, but does not manage the PIE Framework project core\ncommitters team leadership.</li>\n<li>Intended to replace existing mechanisms for community input, governance,\nor contribution.</li>\n<li>Intended to assume a formal, fiduciary role with respect to the project.</li>\n</ul>\n<h2 id=\"3-scope\"><a href=\"#3-scope\" class=\"phenomic-HeadingAnchor\">#</a>3. Scope</h2>\n<h3 id=\"31\"><a href=\"#31\" class=\"phenomic-HeadingAnchor\">#</a>3.1</h3>\n<p>The PIE Framework Advisory Board is expected to provide input and formal\nrecommendations regarding the following areas:</p>\n<ul>\n<li>PIE Framework project long term roadmap</li>\n<li>PIE Framework project policies and procedures around maintenance, contributions,\ncore team membership, integrator status and governance.</li>\n<li>PIE Framework project policies and procedures around intellectual property,\ntrademark, and licensing</li>\n<li>PIE Framework project release schedules</li>\n</ul>\n<h2 id=\"4-meetings-and-memberships\"><a href=\"#4-meetings-and-memberships\" class=\"phenomic-HeadingAnchor\">#</a>4. Meetings and Memberships</h2>\n<h3 id=\"41-general\"><a href=\"#41-general\" class=\"phenomic-HeadingAnchor\">#</a>4.1 General</h3>\n<ul>\n<li>The PIE Framework Advisory Board will have at least 3 members and not more than 11</li>\n<li>Curator Seat: The PIE Framework CoreSpring project lead Evan Eustace will act as Curator</li>\n<li>2 seats for the top integrator contributors</li>\n<li>Up to 8 additional seats: 5 sponsor seats, 3 top \"contributor\" seats</li>\n</ul>\n<h3 id=\"42\"><a href=\"#42\" class=\"phenomic-HeadingAnchor\">#</a>4.2</h3>\n<p>The selection process is intended to be open, transparent, and guided by\nobjective criteria for membership.</p>\n<h3 id=\"43\"><a href=\"#43\" class=\"phenomic-HeadingAnchor\">#</a>4.3</h3>\n<p>The Curator shall prepare an agenda for and preside over regular meetings of\nthe PIE Framework Advisory Board. These meetings shall occur as frequently as the\nPIE Framework Advisory Board determines is in the project’s best interest, but no\nless than quarterly.</p>\n<h3 id=\"44\"><a href=\"#44\" class=\"phenomic-HeadingAnchor\">#</a>4.4</h3>\n<p>A member of the PIE Framework Advisory Board may be removed by a resolution of the\nPIE Framework Advisory Board supported by more than two thirds of its membership.</p>\n<h3 id=\"45\"><a href=\"#45\" class=\"phenomic-HeadingAnchor\">#</a>4.5</h3>\n<p>The PIE Framework Advisory Board may add a new member or fill any vacancy arising by removal or\nresignation by a simple majority vote to fill the remainder of the term of the\nvacating member.</p>\n<h3 id=\"46\"><a href=\"#46\" class=\"phenomic-HeadingAnchor\">#</a>4.6</h3>\n<p>The rules of selection and membership outlined in this section may be varied by\na resolution of the PIE Framework Advisory Board supported by more than two thirds of\nits voting membership.</p>\n<h3 id=\"47\"><a href=\"#47\" class=\"phenomic-HeadingAnchor\">#</a>4.7</h3>\n<p>All project contributors are welcome to observe at PIE Framework Advisory Board\nmeetings.</p>\n<h2 id=\"5-selection-process\"><a href=\"#5-selection-process\" class=\"phenomic-HeadingAnchor\">#</a>5. Selection Process</h2>\n<h3 id=\"51-integrator-seats\"><a href=\"#51-integrator-seats\" class=\"phenomic-HeadingAnchor\">#</a>5.1 Integrator Seats</h3>\n<p>Integrators are project participants who have been granted write access to the projects to merge pull requests from contributors. </p>\n<p>Integrator status will be offered to contributors who have made substantial contributions, and who are exemplars of best practices as established by the community.</p>\n<p>The current and initial integrators are the contributors from the CoreSpring team, the intention is to convert key contributors to integrators.</p>\n<h3 id=\"51-contributor-seats\"><a href=\"#51-contributor-seats\" class=\"phenomic-HeadingAnchor\">#</a>5.1 Contributor Seats</h3>\n<p>Seats will be reserved for the top technical contributors, as measured by\nnon-trivial pull requests as determined by the core integrator team that have\nbeen merged into the master in the previous 6 months.  These seats will be\nreserved for active individual contributors who are neither employees of\nCoreSpring, Inc. nor employees of companies that hold a corporate sponsor seat.</p>\n<h3 id=\"52-sponsor-seats\"><a href=\"#52-sponsor-seats\" class=\"phenomic-HeadingAnchor\">#</a>5.2 Sponsor seats</h3>\n<p>Organizations who provide significant sponsorship to the project will be offered a seat for the\nduration of their sponsorship term, unless seat is removed according to process described here.</p>\n<h3 id=\"53-curator-seat\"><a href=\"#53-curator-seat\" class=\"phenomic-HeadingAnchor\">#</a>5.3 Curator Seat</h3>\n<p>A seat is reserved for a Curator as described in 4.3. If a replacement curator is needed a simple majority vote will be held.</p>\n<h2 id=\"6-operation\"><a href=\"#6-operation\" class=\"phenomic-HeadingAnchor\">#</a>6. Operation</h2>\n<h3 id=\"61\"><a href=\"#61\" class=\"phenomic-HeadingAnchor\">#</a>6.1</h3>\n<p>The PIE Framework Advisory Board may seek advice and counsel from other\ninterested parties and invited experts as appropriate.</p>\n<h3 id=\"62\"><a href=\"#62\" class=\"phenomic-HeadingAnchor\">#</a>6.2</h3>\n<p>Any outside party wishing to bring an issue before the PIE Framework Advisory Board\nmay do so by emailing the PIE Framework Advisory Board at\n<a href=\"mailto:advisoryboard@corespring.org\">advisoryboard@corespring.org</a>.</p>\n<h3 id=\"63\"><a href=\"#63\" class=\"phenomic-HeadingAnchor\">#</a>6.3</h3>\n<p>The PIE Framework Advisory Board shall provide transparent and timely reporting\n(through any mechanism it deems appropriate) to the PIE Framework community at large\non all of its activities, subject to the right of any individual to designate\ntheir comments and the ensuing discussion as \"in confidence,\" in which case the\npublic report shall contain only a note of the request and an agreed summary\n(if any) of the substance.</p>\n<h3 id=\"64\"><a href=\"#64\" class=\"phenomic-HeadingAnchor\">#</a>6.4</h3>\n<p>The PIE Framework Advisory Board is being formed at the discretion of CoreSpring. CoreSpring\nalone may decide to terminate the PIE Framework Advisory Board in its sole\ndiscretion; provided however, that CoreSpring shall first consult the PIE Framework\nAdvisory Board, Curator, and Sponsors.</p>\n<h3 id=\"65\"><a href=\"#65\" class=\"phenomic-HeadingAnchor\">#</a>6.5</h3>\n<p>The PIE Framework Advisory Board and its members shall abide by appropriate antitrust\nguidelines.</p>\n<h2 id=\"7--open-governance-principles\"><a href=\"#7--open-governance-principles\" class=\"phenomic-HeadingAnchor\">#</a>7.  Open Governance Principles</h2>\n<p>The PIE Framework Advisory Board will formulate recommendations in conjunction with\nthe following open governance principles:</p>\n<ul>\n<li>Open Contributions: anyone should be able to participate and contribute to the project.\nAll bugs and tasks will be tracked in a public tracker and all of the\nsource code and all of the tools needed to build it will be available under\nan open license permitting unrestricted use.</li>\n<li>Open technical meritocracy: technical merit over pride of authorship. Code\nis contributed for the express purpose of advancing technologies relevant\nto the project, effectively separating technology advancement from\nindividual or commercial intent.</li>\n<li>Open design: Roadmaps are discussed in the open, and designs receive input\nfrom all committers and contributors.</li>\n<li>Influence through contribution: organizations and individuals gain\ninfluence over the project through contribution.</li>\n<li>Open Licensing: code is licensed under the ISC license.</li>\n</ul>\n","__filename":"docs/community/advisory-board.md","__url":"/docs/community/advisory-board/","__resourceUrl":"/docs/community/advisory-board/index.html","__dataUrl":"/docs/community/advisory-board/index.html.9bf345bca1f199fb76a7c095e7969ebc.json"}